from lib import error_stream


################################################
# параметры
################################################
print()
print("Вероятность появления ошибки в первой последовательности:", p1 := .1)
print("Вероятность появления ошибки во второй последовательности:", p2 := .05)
print("Длинна последовательностей:", n := 100)
print()


################################################
if __name__ == '__main__':
    ############################################

    E1 = error_stream(p1)
    E2 = error_stream(p2)

    print("E1: ", *list(E1(n)), sep='')
    print("E2: ", *list(E2(n)), sep='')
